<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"25d1c38cd553268af89f3d14f1a9bcf73cdbd13114f693dd63e2e9c12378b43c","plan_job_ref":"Job terraform-plan-04-aws-wireguard-vpn #142 at https://github.com/pipetail/terraform/actions/runs/21805693023","plan_out_hash":"6317643d9e0e2e6cadde151742745ed219f65090d0a4a31d45f46edb1dff513c","plan_hash":"f11c27c7b27249ae93f243cd3b3a68222c6b10abe49cc04279e728d9315fe5c4","plan_text_format":"diff","version":"2.2.3","closed":true} -->
Terraform plan in __examples/04-aws-wireguard-vpn__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.wireguard_vpn.module.ec2_instance.aws_instance.this[0] will be created
+   resource "aws_instance" "this" {
+       ami                                  = "ami-05dff77713a4fa273"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = true
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "************************"
+       tags                                 = {
+           "Name" = "wireguard-vpn"
        }
+       tags_all                             = {
+           "Name" = "wireguard-vpn"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       volume_tags                          = {
+           "Name" = "wireguard-vpn"
        }
+       vpc_security_group_ids               = [
+           "sg-030f490617bf8b896",
        ]

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       credit_specification {}

+       ebs_block_device (known after apply)

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device (known after apply)

+       instance_market_options (known after apply)

+       maintenance_options (known after apply)

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "********"
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)

+       timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   vpn_config    = (known after apply)
```
</details>

:x: Error applying plan in [terraform-apply-04-aws-wireguard-vpn #66](https://github.com/pipetail/terraform/actions/runs/21805761259)